Cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @cat = Cat.new(cat_params)
    # debugger
    if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["name", "PENELOPY MUGGINS"], ["description", "Future cats squad leader - sharp claws and killer eyes - she's one not to mess with."], ["updated_at", "2018-10-16 21:22:52.175214"], ["id", 11]]
---
  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update_attributes(cat_params)